cases/flameletPimpleSMOKE/Sandia_COH2N2/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.2;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 101325;

boundaryField
{
    inletfuel           
    {
        type            zeroGradient;
    }

    inletair           
    {
        type            zeroGradient;
    }

    "outlet|sidewall"
    {
        type            totalPressure;
	p0		$internalField;
	phi		phi;
	U		U;
	psi		none;
	gamma		0;
        value           $internalField;
    }

    burnerwall       
    {
        type            zeroGradient;
    }

    front    
    {
        type            wedge;
    }

    back   
    {
        type            wedge;
    }

    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
