cases/flameletPimpleSMOKE/Sandia_COH2N2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.2;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0.1;
    }

    rhoFinal
    {
        $rho;
        tolerance       1e-6;
        relTol          0;
    }

    p
    {
        solver                GAMG;
        tolerance             1e-7;
        relTol                0.01;
        smoother              GaussSeidel;
        cacheAgglomeration    true;
        nCellsInCoarsestLevel 20;
        agglomerator          faceAreaPair;
        mergeLevels           1;
    }

    pFinal
    {
        solver                GAMG;
        tolerance             1e-6;
        relTol                0;
        smoother              GaussSeidel;
        cacheAgglomeration    true;
        nCellsInCoarsestLevel 20;
        agglomerator          faceAreaPair;
        mergeLevels           1;
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0.1;
	minIter		1;
    }

    UFinal
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;
	minIter		1;
    }

    "(k|epsilon|H|Z|Zvar)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0.1;
	minIter		1;
    }

    "(k|epsilon|H|Z|Zvar)Final"
    {
        $U;
        tolerance       1e-9;
        relTol          0;
	minIter		1;
    }
}

PIMPLE
{
    rhoMin          rhoMin [ 1 -3 0 0 0 ] 0.2;
    rhoMax          rhoMax [ 1 -3 0 0 0 ] 2.0;

    nOuterCorrectors 		1;
    nCorrectors     		2;
    nNonOrthogonalCorrectors 	0;
    momentumPredictor 		no;
}

// ************************************************************************* //
